КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиОрганизаций/КонтурЛогистика_НастройкиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиОрганизаций</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>String</types>
      <types>EnumRef.КонтурЛогистика_НастройкиОрганизацийДиадок</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_НастройкиОрганизацийДиадок/КонтурЛогистика_НастройкиОрганизацийДиадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_НастройкиОрганизацийДиадок</name>
  <enumValues>
    <name>LogisticsApiKey</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытий</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДатаПЛ</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийСервисаФизическихЛицДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийПЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоказанияГСМВЭПЛ</name>
    <comment>Проверка наличия показаний ГСМ на выезде и заезде в сервисе</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеОтправительПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеПолучательПутевогоЛиста</name>
    <comment>если отправитель = получателю в Диадоке</comment>
  </enumValues>
  <enumValues>
    <name>ПодразделениеТрН</name>
  </enumValues>
  <enumValues>
    <name>РазрешитьВодителямВноситьПоказанияГСМ</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуДиадок</name>
  </enumValues>
  <enumValues>
    <name>ЧитатьЛентуЛогистики</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадокДата</name>
  </enumValues>
  <enumValues>
    <name>АктуальностьЛентыСобытийДиадок</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Настройки/КонтурЛогистика_Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Настройки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Значение</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗначений</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ВсеСправочникиУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Партнеры/КонтурЛогистика_Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Партнеры</name>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДЭлПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОрганизацииДиадок</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ГО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Диспетчер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Медик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Техник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>boxId</name>
      <comment>ящик диадок (на случай если роуминг или несколько провайдеров)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Настройки</types>
        <types>CatalogRef.КонтурЛогистика_НастройкиПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработчики</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СобытияОбработчиковПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОбработкиПослеЗаполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыМаршрута</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИндекс</name>
      <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКодРегион</name>
      <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИнфКодСтраны</name>
      <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресГород</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресНаселПункт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресУлица</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресРайон</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДом</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКорпус</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКварт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прибытие</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_МетрикаПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ИдентификаторПользователяИБ() Экспорт

	ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
    АнонимныйПользовательИБ = Строка(ИдентификаторПользователяИБ) = "071523a4-516f-4fce-ba4b-0d11ab7a1893";
    Если АнонимныйПользовательИБ Тогда
        ИдентификаторПользователяИБ = ИдентификаторПользователяОС();
    КонецЕсли;
 
    Возврат ИдентификаторПользователяИБ;
	
КонецФункции

Функция IDСессии() Экспорт

	Возврат КонтурЛогистика_МетрикаКлиентСервер.НовыйУИД();

КонецФункции

Функция ОписаниеОС() Экспорт

	СисИнфо = Новый СистемнаяИнформация();
	ТипОС = НРег(СисИнфо.ТипПлатформы);

	Если Найти(ТипОС, НРег("Linux")) > 0 Тогда
		Name = "Linux";
	ИначеЕсли Найти(ТипОС, НРег("MacOS")) > 0 Тогда
		Name = "MacOS";
	ИначеЕсли Найти(ТипОС, НРег("Windows")) > 0 Тогда
		Name = "Windows";
	КонецЕсли;

	Если Найти(ТипОС, "64") > 0 Тогда
		BitSet = "x64";
	Иначе
		BitSet = "x86";
	КонецЕсли;

	Результат = Новый Структура();
	Результат.Вставить("Name", 		Name);
	Результат.Вставить("BitSet", 	BitSet);
	Результат.Вставить("Version", 	"1.0.0");

	Возврат Результат;

КонецФункции

Функция ОписаниеБраузера() Экспорт

	Результат = Новый Структура();
	СисИнфо = Новый СистемнаяИнформация();

	UserAgent = СисИнфо.ИнформацияПрограммыПросмотра;
	Если ЗначениеЗаполнено(UserAgent) Тогда
		Результат.Вставить("UserAgent", UserAgent);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ОписаниеПрограммы() Экспорт

	СисИнфо = Новый СистемнаяИнформация();

	Если Найти(СисИнфо.ТипПлатформы, "64") > 0 Тогда
		BitSet = "x64";
	Иначе
		BitSet = "x86";
	КонецЕсли;

	ТекущийРежимЗапуска	 = ТекущийРежимЗапуска();
	RunMode 	         = ?(ТекущийРежимЗапуска = Неопределено, "Регламентное задание", Строка(ТекущийРежимЗапуска));

	Результат = Новый Структура();
	Результат.Вставить("Name", 					"1С:Предприятие 8 " + BitSet);
	Результат.Вставить("Configuration", 		Метаданные.Имя);
	Результат.Вставить("ConfigurationVersion", 	КонтурЛогистика_Метрика.ПреобразоватьВерсиюВСемантик(Метаданные.Версия));
	Результат.Вставить("RunMode", 				RunMode);
	Результат.Вставить("Version", 				КонтурЛогистика_Метрика.ПреобразоватьВерсиюВСемантик(СисИнфо.ВерсияПриложения));

	Возврат Результат;

КонецФункции

Функция ОписаниеАппаратногоОбеспечения() Экспорт

	СисИнфо = Новый СистемнаяИнформация();
	TotalMemoryGb = Окр(СисИнфо.ОперативнаяПамять / 1000);

	Результат = Новый Структура();
	Результат.Вставить("TotalMemoryGb", TotalMemoryGb);

	Возврат Результат;

КонецФункции

Функция РазобратьСтрокуСоединенияИнформационнойБазы() Экспорт
	
	Результат = Новый Структура;
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Если Найти(ВРег(СтрокаСоединения),"FILE")>0 Тогда
		Результат.Вставить("ТипСоединения","Файловая");
		КаталогБазы = Сред(СтрокаСоединения,7);
		ПозицияРазделителя = Найти(КаталогБазы,"""");
		
		Если ПозицияРазделителя=0 Тогда
			Сообщить("Не удалось разобрать путь к базе:" + СтрокаСоединенияИнформационнойБазы());	
			Возврат Результат;
		КонецЕсли;	
		
		КаталогБазы = Лев(КаталогБазы,ПозицияРазделителя-1);
		Если Прав(КаталогБазы,1)<>"\" Тогда 
			КаталогБазы = КаталогБазы+"\"; 
		КонецЕсли;
		
		Результат.Вставить("КаталогБазы",КаталогБазы);
		
	ИначеЕсли Найти(ВРег(СтрокаСоединения),"SRVR")>0 Тогда
		Результат.Вставить("ТипСоединения","Серверная");
		СтрокаСоединения = Сред(СтрокаСоединения,7);
		ПозицияРазделителя = Найти(СтрокаСоединения,";");
		
		Если ПозицияРазделителя=0 Тогда
			Сообщить("Не удалось разобрать путь к базе:"+СтрокаСоединенияИнформационнойБазы());	
			Возврат Результат;
		КонецЕсли;	
		
		ИмяСервера = Лев(СтрокаСоединения,ПозицияРазделителя-2);
		
		ИмяБазы = Сред(СтрокаСоединения,ПозицияРазделителя+6);
		ПозицияРазделителя = Найти(ИмяБазы,";");
		
		Если ПозицияРазделителя=0 Тогда
			Сообщить("Не удалось разобрать путь к базе:"+СтрокаСоединенияИнформационнойБазы());	
			Возврат Результат;
		КонецЕсли;	
		
		ИмяБазы = Лев(ИмяБазы,ПозицияРазделителя-2);
		
		Результат.Вставить("ИмяСервера",ИмяСервера);
		Результат.Вставить("ИмяБазы",ИмяБазы);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекПользовательБазы() Экспорт
	
	Попытка
		ПользовательБазы = Неопределено;
		Выполнить("ПользовательБазы = ПользователиИнформационнойБазы.ТекущийПользователь()");
		ПользовательБазы = Строка(ПользовательБазы);
	Исключение
		ПользовательБазы = "НеОпределен";
	КонецПопытки;
	
	Возврат ПользовательБазы;
	
КонецФункции

Функция ИнфоОПроцессоре() Экспорт
	
	СИ = Новый СистемнаяИнформация;
	
	Возврат СИ.Процессор;
	
КонецФункции

Функция ВерсияБСП() Экспорт
	
	ВерсияБСП = Неопределено;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные("ОбщиеМодули.СтандартныеПодсистемыСервер") Тогда
		
		Попытка
			
			Выполнить("ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки()");
			
		Исключение
			
			ВерсияБСП = "0.0.0"; 
						
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ВерсияБСП;

КонецФункции

Функция ИнфоОНастройках() Экспорт
		
	Настройки = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения КАК ИмяПредопределенногоДляРасширения,
	               |	КонтурЛогистика_Настройки.Значение КАК Значение
	               |ИЗ
	               |	Справочник.КонтурЛогистика_Настройки КАК КонтурЛогистика_Настройки
	               |ГДЕ
	               |	НЕ КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения = """"
	               |	И НЕ КонтурЛогистика_Настройки.ЭтоГруппа
	               |	И НЕ КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения ПОДОБНО ""%Пароль%""
				   |	И НЕ КонтурЛогистика_Настройки.ИмяПредопределенногоДляРасширения ПОДОБНО ""%КлючРазработчика%""";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Настройки.Вставить(Выборка.ИмяПредопределенногоДляРасширения, Строка(Выборка.Значение));
			
	КонецЦикла;
	
	Возврат Настройки;
	
КонецФункции

Функция ИнфоОПартнерах() Экспорт
		
	МассивПартнеров = Справочники.КонтурЛогистика_Партнеры.ДобавленныеПартнеры();
	
	Возврат МассивПартнеров;
	
КонецФункции

Функция НастройкиОрганизации(ОрганизацияДиадок) Экспорт
	
	СписокИсключений = Новый Массив;
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.LogisticsApiKey);
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытий);
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДата);
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийДатаПЛ);
	СписокИсключений.Добавить(Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.АктуальностьЛентыСобытийПЛ);
	
	НастройкиОрганизации = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ОрганизацияДиадок);
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтурЛогистика_НастройкиОрганизаций.Настройка КАК Настройка,
	|	КонтурЛогистика_НастройкиОрганизаций.ЗначениеНастройки КАК ЗначениеНастройки
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_НастройкиОрганизаций КАК КонтурЛогистика_НастройкиОрганизаций
	|ГДЕ
	|	КонтурЛогистика_НастройкиОрганизаций.ОрганизацияДиадок = &ОрганизацияДиадок
	|	И НЕ КонтурЛогистика_НастройкиОрганизаций.Настройка В(&СписокИсключений)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастройкиОрганизации.Вставить(Строка(Выборка.Настройка), Строка(Выборка.ЗначениеНастройки));
	КонецЦикла;
	
	Возврат НастройкиОрганизации;
	
КонецФункции

Функция ДанныеАвтоматическогоОбновления() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Данные = Новый Структура;
	Данные.Вставить("АвтоматическоеОбновлениеВключено", Ложь);
	Данные.Вставить("РасписаниеАвтоматическогоОбновления", "");
	
	Если Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодсистемаКакРасширение() Тогда
		Возврат Данные;
	КонецЕсли;
	
	ИмяОбъекта = "РасширениеКонтурЛогистикаБандл";
	Идентификатор = "РасширениеКонтурЛогистикаБандл.ffdfc67a4c844632b3af1b6ef03dc40b";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеОтчетыИОбработкиКоманды.РегламентноеЗаданиеGUID КАК РегламентноеЗаданиеGUID
	|ИЗ
	|	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	|		ПО (ДополнительныеОтчетыИОбработкиКоманды.Ссылка = ДополнительныеОтчетыИОбработки.Ссылка)
	|ГДЕ
	|	ДополнительныеОтчетыИОбработки.ИмяОбъекта = &ИмяОбъекта
	|	И ДополнительныеОтчетыИОбработкиКоманды.Идентификатор = &Идентификатор";
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Возврат Данные;
	КонецПопытки;
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.РегламентноеЗаданиеGUID) Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Выборка.РегламентноеЗаданиеGUID);
		
		Данные.АвтоматическоеОбновлениеВключено = РегламентноеЗадание.Использование;
		Данные.РасписаниеАвтоматическогоОбновления = Строка(РегламентноеЗадание.Расписание);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ИдентификаторПользователяОС() Экспорт
 
    СистемнаяИнформация1 = Новый СистемнаяИнформация;
    СистемнаяИнформация2 = Новый СистемнаяИнформация;
 
    Если СистемнаяИнформация1.ИдентификаторКлиента = СистемнаяИнформация2.ИдентификаторКлиента Тогда
        ИдентификаторКлиента = СистемнаяИнформация1.ИдентификаторКлиента;
    Иначе
        // https://devtrainingforum.v8.1c.ru/forum/thread.jsp?id=588350&threadtype=0
        // Константа - Ошибка идентификации клиента, переменный идентификатор
        ИдентификаторКлиента = Новый УникальныйИдентификатор("d808d128-2d0e-498e-a728-20bdbe6aae56");
    КонецЕсли; 
 
    Если Строка(ИдентификаторКлиента) = "00000000-0000-0000-0000-000000000000" Тогда
        // Константа - Ошибка идентификации клиента, пустой идентификатор
        ИдентификаторКлиента = Новый УникальныйИдентификатор("d808d128-7a45-43c4-88f2-7d666470b842");
    КонецЕсли;  
 
    Возврат ИдентификаторКлиента;
 
КонецФункции

Функция АдресСервера() Экспорт
	
	// метрики всегда отправляются на бой. в самой метрике есть признак "Окружение", 
	// по которому будем определять какой сервер ДД используется тестовый или боевой
	
	ОтправлятьМетрикиВТест 				= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ОтправлятьМетрикиВТест");
	ИспользоватьТестовыйСерверДиадок 	= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	URLАдреса_Контур = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.URLАдреса_Контур();
	
	Если ИспользоватьТестовыйСерверДиадок Или ОтправлятьМетрикиВТест Тогда 	
	
		Возврат URLАдреса_Контур.СервисПорталТестовый;
		
	Иначе
		
		Возврат URLАдреса_Контур.СервисПортал;
		
	КонецЕсли;
		
КонецФункции

Функция ОтправкаМетрикНаТестовыйСерверЗаблокирована() Экспорт
	
	ОтправлятьМетрикиВТест 				= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ОтправлятьМетрикиВТест");
	ИспользоватьТестовыйСерверДиадок 	= КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
	
	Возврат ИспользоватьТестовыйСерверДиадок И НЕ ОтправлятьМетрикиВТест;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяВерсия()

	Возврат "0.0.0";

КонецФункции

#КонецОбласти
